// ConsoleApplication1.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//


#include"pch.h"
#include<stdio.h>
#include<math.h>
#include<Windows.h>

int main(void) {
	/*
	八度音的频率对照表
	相邻两组同音名音的频率相差为2倍
	音阶     频率
	1 do     256
	2 re     288
	3 mi     320
	4 fa     341.33333
	5 so     384.66666
	6 la     426
	7 si     480
	1 上do   512
	*/
	
	Beep(426/2, 500);Beep(256, 500);
	Beep(384.66666, 500);Beep(256, 500);
	Beep(341.33333/2, 500); Beep(384.66666/2, 250); Beep(426/2, 250);
	Beep(384.66666, 500); Beep(256, 500);
	
	Sleep(500);
	Beep(384.66666, 500);
	Beep(384.66666, 250);
	Beep(256, 750);
	Beep(256, 1000);
	Beep(288, 500);
	Beep(320, 500);

	Sleep(500);
	Beep(384.66666, 500); 
	Beep(384.66666, 500);
	Beep(256, 500);
	Beep(256, 500);
	Beep(288, 250);
	Beep(320, 250);
	Beep(288, 250);
	Beep(256, 250);
	Beep(192.3333, 500);


	return 0;
}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
